{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "2130e524-d62e-4ad8-84c1-d9372ae5029a",
   "metadata": {
    "editable": true,
    "slideshow": {
     "slide_type": ""
    },
    "tags": []
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import json\n",
    "import csv\n",
    "from neo4j import GraphDatabase\n",
    "import matplotlib.pyplot as plt\n",
    "import networkx as nx\n",
    "import json\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "82ce04b3-a8d5-454a-9fb8-1d1a8ed0fa60",
   "metadata": {},
   "source": [
    "## Connect to Reactome graph database using neo4j driver"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "0705be2d-8952-4c7e-8db1-385ddf17d9f6",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "\n",
    "class Neo4jConnection:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__password = password\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__password))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "\n",
    "\n",
    "            \n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        with self.__driver.session(database=db) as session:\n",
    "            result = list(session.run(query, parameters))\n",
    "            # return [record for record in result]\n",
    "            return result\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "0a31e905-ecfb-4f57-b64f-46104658bd6e",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "\n",
    "def flatten_node_data(records):\n",
    "    \"\"\"Extracts and flattens data from Neo4j records into a list of dictionaries.\"\"\"\n",
    "    data = []\n",
    "    for record in records:\n",
    "        node = record['n']\n",
    "        flat_data = dict(node)\n",
    "        flat_data['element_id'] = node.id\n",
    "        data.append(flat_data)\n",
    "    return data\n",
    "\n",
    "def save_to_csv(records, csv_file_path=None):\n",
    "    \"\"\"\n",
    "    Converts Neo4j query results to a pandas DataFrame and optionally saves to a CSV file.\n",
    "    \n",
    "    :param records: List of Neo4j Record objects.\n",
    "    :param csv_file_path: Optional path to save the CSV file. If None, no CSV will be saved.\n",
    "    :return: pandas DataFrame containing the extracted data.\n",
    "    \"\"\"\n",
    "    data = flatten_node_data(records)\n",
    "    df = pd.DataFrame(data)\n",
    "    \n",
    "    if csv_file_path:\n",
    "        df.to_csv(csv_file_path, index=False)\n",
    "    \n",
    "    return df\n",
    "\n",
    "\n",
    "def save_to_gml_v2(query_output, file_name):\n",
    "\n",
    "    G = nx.MultiDiGraph()\n",
    "\n",
    "\n",
    "    node_id_map = {}\n",
    "\n",
    "\n",
    "    for node, relationship in query_output.items():\n",
    "        node_properties = dict(node._properties) \n",
    "        node_properties['labels'] = list(node.labels)  \n",
    "        G.add_node(node.element_id, **node_properties)\n",
    "        node_id_map[node.element_id] = node \n",
    "\n",
    "    for node, relationship in query_output.items():\n",
    "        for rel_node in relationship.nodes:\n",
    "            if rel_node.element_id != node.element_id:\n",
    "                edge_properties = dict(relationship._properties)\n",
    "                G.add_edge(node.element_id, rel_node.element_id, **edge_properties)\n",
    "\n",
    "    nx.write_gml(G, file_name)\n",
    "\n",
    "\n",
    "def convert_attributes(data):\n",
    "    converted = {}\n",
    "    for key, value in data.items():\n",
    "        # Convert lists and dictionaries (and any other non-supported types) to strings\n",
    "        if isinstance(value, (list, dict)):\n",
    "            converted_value = json.dumps(value)\n",
    "        else:\n",
    "            converted_value = value\n",
    "        converted[key] = converted_value\n",
    "    return converted\n",
    "\n",
    "def save_to_gml(query_results, file_name):\n",
    "\n",
    "    G = nx.MultiDiGraph()\n",
    "    \n",
    "    for record in results:\n",
    "        print(record._Record__keys[0])\n",
    "        for node in record[\"nodes\"]:\n",
    "            node_attrs = dict(node)\n",
    "            node_attrs_converted = convert_attributes(node_attrs)\n",
    "            G.add_node(node.id, **node_attrs_converted)\n",
    "            \n",
    "        for relationship in record[\"relationships\"]:\n",
    "            rel_attrs = dict(relationship)\n",
    "            rel_attrs_converted = convert_attributes(rel_attrs)\n",
    "            G.add_edge(relationship.start_node.id, relationship.end_node.id, **rel_attrs_converted)\n",
    "    \n",
    "    nx.write_gml(G, file_name)\n",
    "\n",
    "def save_to_gml_v3(query_results, file_name):\n",
    "    G = nx.MultiDiGraph()\n",
    "    for record in query_results:\n",
    "        r = record[record._Record__keys[0]]\n",
    "        rel = record[record._Record__keys[1]]\n",
    "        connectedNodes = record[record._Record__keys[2]]\n",
    "\n",
    "        # Add nodes\n",
    "        G.add_node(r.id, label='Reaction', **dict(r))\n",
    "        G.add_node(connectedNodes.id, **dict(connectedNodes))\n",
    "\n",
    "        # Add edge\n",
    "        G.add_edge(r.id, connectedNodes.id, key=rel.type, **dict(rel))\n",
    "\n",
    "    # Save to GML\n",
    "    nx.write_gml(G, file_name)\n",
    "    print(f\"Graph saved to {file_name}.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d1a815fd-ce11-429a-864a-ecfb605aae5c",
   "metadata": {},
   "source": [
    "## Query from reactome\n",
    "\n",
    "#### Extract the nodes and edges that have species schemaClass Reaction and speciesName Mouse connect to \n",
    "```cypher\n",
    "MATCH (r:Reaction)-[rel]-(connectedNodes)\n",
    "WHERE r.schemaClass = 'Reaction' AND r.speciesName = 'Mus musculus'\n",
    "RETURN r, rel, connectedNodes \n",
    "```\n",
    "\n",
    "#### Returns a collection of records, where each record represents a path involving \"Mus musculus\". Each record contains a list of nodes (nodes) that are part of the path and a list of relationships that connect the nodes in the path\n",
    "\n",
    "```cypher\n",
    "MATCH path=(n)-[r:species]->(m) WHERE 'Mus musculus' IN n.speciesName OR 'Mus musculus' IN m.speciesName\n",
    "WITH path, relationships(path) AS rs\n",
    "RETURN nodes(path) AS nodes, rs AS relationships\n",
    "```\n",
    "\n",
    "\n",
    "```cypher\n",
    "MATCH (o)-[r:species]->(m:Taxon{abbreviation:'MMU'})\n",
    "RETURN o AS nodes, r AS relationships\n",
    "UNION\n",
    "MATCH (o)-[s]-(n)-[r:species]->(m:Taxon{abbreviation:'MMU'})\n",
    "WHERE type(s) <> 'created'\n",
    "AND type(s) <> \"reference_Database\"\n",
    "RETURN o AS nodes, r AS relationships\n",
    "```\n",
    "\n",
    "#### Returns the type and count of reltionship types that connect nodes with the reaction schemaClass and Mouse species\n",
    "```cypher\n",
    "MATCH (r:Reaction)-[rel]-(connectedNodes)\n",
    "WHERE r.schemaClass = 'Reaction' AND r.speciesName = 'Mus musculus'\n",
    "RETURN type(rel), count(type(rel))\n",
    "limit 100\n",
    "```\n",
    "\n",
    "#### Extract connected nodes to the mouse species nodes with reaction schemaClass with a specific type of relationship (e.g., disease)\n",
    "```cypher\n",
    "MATCH (r:Reaction)-[rel]-(connectedNodes)\n",
    "WHERE r.schemaClass = 'Reaction' AND r.speciesName = 'Mus musculus' AND type(rel) = 'disease'\n",
    "RETURN connectedNodes\n",
    "limit 100\n",
    "```\n",
    "\n",
    "\n",
    "#### Returns information about the nodes connected to 'Reaction' nodes for the species Mouse, along with the types of relationships connecting them and the count of these occurrences.\n",
    "\n",
    "```cypher\n",
    "MATCH (r:Reaction)-[rel]-(connectedNodes)\n",
    "WHERE r.schemaClass = 'Reaction' AND r.speciesName = 'Mus musculus'\n",
    "RETURN connectedNodes.schemaClass, type(rel), count(*)\n",
    "order by type(rel)\n",
    "limit 100\n",
    "\n",
    "```\n",
    "\n",
    "#### Export a query into a graphml format using apoc\n",
    "```cypher\n",
    "WITH \"MATCH (r:Reaction)-[rel]-(connectedNodes)\n",
    "WHERE r.schemaClass = 'Reaction' AND r.speciesName = 'Mus musculus'\n",
    "RETURN connectedNodes,rel\" AS query\n",
    "CALL apoc.export.graphml.query(query, \"mouse.graphml\", {format:\"gephi\", useTypes:true, readLabels:True})\n",
    "YIELD file, source, format, nodes, relationships, properties, time, rows, batchSize, batches, done, data\n",
    "RETURN file, source, format, nodes, relationships, properties, time, rows, batchSize, batches, done, data;\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "045c717b-f973-4d34-8d63-0b3bd68c15f3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph saved to data/mouse_query_small_graph.gml.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_18803/910133039.py:88: DeprecationWarning: `id` is deprecated, use `element_id` instead\n",
      "  G.add_node(r.id, label='Reaction', **dict(r))\n",
      "/tmp/ipykernel_18803/910133039.py:89: DeprecationWarning: `id` is deprecated, use `element_id` instead\n",
      "  G.add_node(connectedNodes.id, **dict(connectedNodes))\n",
      "/tmp/ipykernel_18803/910133039.py:92: DeprecationWarning: `id` is deprecated, use `element_id` instead\n",
      "  G.add_edge(r.id, connectedNodes.id, key=rel.type, **dict(rel))\n"
     ]
    }
   ],
   "source": [
    "uri = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"neo4j\"\n",
    "\n",
    "# First query\n",
    "\n",
    "# query = \"\"\"\n",
    "# MATCH path=(n)-[r:species]->(m) WHERE 'Mus musculus' IN n.speciesName OR 'Mus musculus' IN m.speciesName\n",
    "# WITH path, relationships(path) AS rs\n",
    "# RETURN nodes(path) AS nodes, rs AS relationships \"\"\"\n",
    "\n",
    "# Second query\n",
    "\n",
    "# query=\"\"\"\n",
    "# MATCH (o)-[r:species]->(m:Taxon{abbreviation:'MMU'})\n",
    "# RETURN o AS nodes, r AS relationships\n",
    "# UNION\n",
    "# MATCH (o)-[s]-(n)-[r:species]->(m:Taxon{abbreviation:'MMU'})\n",
    "# WHERE type(s) <> 'created'\n",
    "# AND type(s) <> \"reference_Database\"\n",
    "# RETURN o AS nodes, r AS relationships\n",
    "\n",
    "# \"\"\"\n",
    "\n",
    "# Third query\n",
    "\n",
    "# query=\"\"\"\n",
    "# MATCH (n)-[r:species]->(m:Taxon{abbreviation:'MMU'})\n",
    "# RETURN n as nodes, r as relationships\n",
    "# \"\"\"\n",
    "\n",
    "query= \"\"\"\n",
    "MATCH (r:Reaction)-[rel]-(connectedNodes)\n",
    "WHERE r.schemaClass = 'Reaction' AND r.speciesName = 'Mus musculus'\n",
    "RETURN r, rel, connectedNodes\n",
    "limit 10\n",
    "\"\"\"\n",
    "\n",
    "# Establish connection\n",
    "conn = Neo4jConnection(uri, user, password)\n",
    "results = conn.query(query)\n",
    "# results = dict(results)\n",
    "save_to_gml_v3(results,'data/mouse_query_small_graph.gml')\n",
    "\n",
    "# Close the connection\n",
    "conn.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2415adda-3ab3-4467-bcf9-8b53582062b1",
   "metadata": {},
   "source": [
    "## Read the gml file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5a6269cf-e286-4c9c-87f8-dbc79c369b15",
   "metadata": {},
   "outputs": [],
   "source": [
    "G = nx.read_gml('mouse.gml')\n",
    "\n",
    "# Print the number of nodes and edges\n",
    "print(f\"Number of nodes: {G.number_of_nodes()}\")\n",
    "print(f\"Number of edges: {G.number_of_edges()}\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "49fd1f76-b0d3-4b0a-891e-91a513baee77",
   "metadata": {},
   "source": [
    "## Visualize the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "65103d78-58b3-4848-b10c-000ae607d120",
   "metadata": {},
   "outputs": [],
   "source": [
    "node_labels = {node: data['displayName'] for node, data in G.nodes(data=True)}\n",
    "\n",
    "plt.figure(figsize=(12, 12)) \n",
    "nx.draw(G, with_labels=True, labels=node_labels, node_size=5000, node_color=\"lightblue\", font_size=9, font_weight=\"bold\")\n",
    "plt.title(\"Graph Visualization\")\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "97309aee-17cf-45fc-a6d4-613501e9409e",
   "metadata": {},
   "source": [
    "## Save the nodes and the edges of the graph in csv files"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "91a8e109-cab2-472e-a4d4-94e12dc3a351",
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes_data = list(G.nodes(data=True))  # List of tuples (node_id, attr_dict)\n",
    "nodes_df = pd.DataFrame([{'node': n, **attr} for n, attr in nodes_data])\n",
    "nodes_df.to_csv('nodes.csv', index=False)\n",
    "\n",
    "# Edges\n",
    "edges_data = list(G.edges(data=True))  # List of tuples (source, target, attr_dict)\n",
    "edges_df = pd.DataFrame([{'source': s, 'target': t, **attr} for s, t, attr in edges_data])\n",
    "edges_df.to_csv('edges.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "4a0db28a-96fe-427a-ad19-a2dda0702268",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Node 0 attributes:\n",
      "  dateTime: \n",
      "  note: \n",
      "  databaseName: \n",
      "  year: nan\n",
      "  displayName: Homo sapiens\n",
      "  minUnitCount: nan\n",
      "  referenceType: \n",
      "  accession: \n",
      "  title: \n",
      "  maxUnitCount: nan\n",
      "  synonym: \n",
      "  journal: \n",
      "  pages: \n",
      "  speciesName: \n",
      "  dbId: 48887.0\n",
      "  releaseStatus: \n",
      "  definition: \n",
      "  text: \n",
      "  isOrdered: False\n",
      "  TYPE: :DatabaseObject:Species:Taxon\n",
      "  isInferred: False\n",
      "  hasDiagram: False\n",
      "  schemaClass: Species\n",
      "  identifier: \n",
      "  systematicName: \n",
      "  oldStId: \n",
      "  isInDisease: False\n",
      "  startCoordinate: nan\n",
      "  releaseDate: \n",
      "  stId: \n",
      "  isChimeric: False\n",
      "  abbreviation: HSA\n",
      "  url: \n",
      "  labels: \n",
      "  volume: nan\n",
      "  diagramHeight: nan\n",
      "  taxId: 9606\n",
      "  stIdVersion: \n",
      "  hasEHLD: False\n",
      "  pubMedIdentifier: nan\n",
      "  endCoordinate: nan\n",
      "  category: \n",
      "  diagramWidth: nan\n",
      "  id: n8\n",
      "\n",
      "Node 1 attributes:\n",
      "  dateTime: \n",
      "  note: \n",
      "  databaseName: GO\n",
      "  year: nan\n",
      "  displayName: lysosomal membrane\n",
      "  minUnitCount: nan\n",
      "  referenceType: \n",
      "  accession: 0005765\n",
      "  title: \n",
      "  maxUnitCount: nan\n",
      "  synonym: \n",
      "  journal: \n",
      "  pages: \n",
      "  speciesName: \n",
      "  dbId: 17938.0\n",
      "  releaseStatus: \n",
      "  definition: The lipid bilayer surrounding the lysosome and separating its contents from the cell cytoplasm.\n",
      "  text: \n",
      "  isOrdered: False\n",
      "  TYPE: :Compartment:DatabaseObject:GO_CellularComponent:GO_Term\n",
      "  isInferred: False\n",
      "  hasDiagram: False\n",
      "  schemaClass: Compartment\n",
      "  identifier: \n",
      "  systematicName: \n",
      "  oldStId: \n",
      "  isInDisease: False\n",
      "  startCoordinate: nan\n",
      "  releaseDate: \n",
      "  stId: \n",
      "  isChimeric: False\n",
      "  abbreviation: \n",
      "  url: https://www.ebi.ac.uk/QuickGO/term/GO:0005765\n",
      "  labels: \n",
      "  volume: nan\n",
      "  diagramHeight: nan\n",
      "  taxId: \n",
      "  stIdVersion: \n",
      "  hasEHLD: False\n",
      "  pubMedIdentifier: nan\n",
      "  endCoordinate: nan\n",
      "  category: \n",
      "  diagramWidth: nan\n",
      "  id: n237\n",
      "\n",
      "Node 2 attributes:\n",
      "  dateTime: \n",
      "  note: \n",
      "  databaseName: GO\n",
      "  year: nan\n",
      "  displayName: cytoplasm\n",
      "  minUnitCount: nan\n",
      "  referenceType: \n",
      "  accession: 0005737\n",
      "  title: \n",
      "  maxUnitCount: nan\n",
      "  synonym: \n",
      "  journal: \n",
      "  pages: \n",
      "  speciesName: \n",
      "  dbId: 459.0\n",
      "  releaseStatus: \n",
      "  definition: The contents of a cell excluding the plasma membrane and nucleus, but including other subcellular structures.\n",
      "  text: \n",
      "  isOrdered: False\n",
      "  TYPE: :Compartment:DatabaseObject:GO_CellularComponent:GO_Term\n",
      "  isInferred: False\n",
      "  hasDiagram: False\n",
      "  schemaClass: Compartment\n",
      "  identifier: \n",
      "  systematicName: \n",
      "  oldStId: \n",
      "  isInDisease: False\n",
      "  startCoordinate: nan\n",
      "  releaseDate: \n",
      "  stId: \n",
      "  isChimeric: False\n",
      "  abbreviation: \n",
      "  url: https://www.ebi.ac.uk/QuickGO/term/GO:0005737\n",
      "  labels: \n",
      "  volume: nan\n",
      "  diagramHeight: nan\n",
      "  taxId: \n",
      "  stIdVersion: \n",
      "  hasEHLD: False\n",
      "  pubMedIdentifier: nan\n",
      "  endCoordinate: nan\n",
      "  category: \n",
      "  diagramWidth: nan\n",
      "  id: n241\n",
      "\n",
      "Node 3 attributes:\n",
      "  dateTime: \n",
      "  note: \n",
      "  databaseName: GO\n",
      "  year: nan\n",
      "  displayName: plasma membrane\n",
      "  minUnitCount: nan\n",
      "  referenceType: \n",
      "  accession: 0005886\n",
      "  title: \n",
      "  maxUnitCount: nan\n",
      "  synonym: \n",
      "  journal: \n",
      "  pages: \n",
      "  speciesName: \n",
      "  dbId: 876.0\n",
      "  releaseStatus: \n",
      "  definition: The membrane surrounding a cell that separates the cell from its external environment. It consists of a phospholipid bilayer and associated proteins.\n",
      "  text: \n",
      "  isOrdered: False\n",
      "  TYPE: :Compartment:DatabaseObject:GO_CellularComponent:GO_Term\n",
      "  isInferred: False\n",
      "  hasDiagram: False\n",
      "  schemaClass: Compartment\n",
      "  identifier: \n",
      "  systematicName: \n",
      "  oldStId: \n",
      "  isInDisease: False\n",
      "  startCoordinate: nan\n",
      "  releaseDate: \n",
      "  stId: \n",
      "  isChimeric: False\n",
      "  abbreviation: \n",
      "  url: https://www.ebi.ac.uk/QuickGO/term/GO:0005886\n",
      "  labels: \n",
      "  volume: nan\n",
      "  diagramHeight: nan\n",
      "  taxId: \n",
      "  stIdVersion: \n",
      "  hasEHLD: False\n",
      "  pubMedIdentifier: nan\n",
      "  endCoordinate: nan\n",
      "  category: \n",
      "  diagramWidth: nan\n",
      "  id: n249\n",
      "\n",
      "Node 4 attributes:\n",
      "  dateTime: \n",
      "  note: \n",
      "  databaseName: GO\n",
      "  year: nan\n",
      "  displayName: extracellular region\n",
      "  minUnitCount: nan\n",
      "  referenceType: \n",
      "  accession: 0005576\n",
      "  title: \n",
      "  maxUnitCount: nan\n",
      "  synonym: \n",
      "  journal: \n",
      "  pages: \n",
      "  speciesName: \n",
      "  dbId: 984.0\n",
      "  releaseStatus: \n",
      "  definition: The space external to the outermost structure of a cell. For cells without external protective or external encapsulating structures this refers to space outside of the plasma membrane. This term covers the host cell environment outside an intracellular parasite.\n",
      "  text: \n",
      "  isOrdered: False\n",
      "  TYPE: :Compartment:DatabaseObject:GO_CellularComponent:GO_Term\n",
      "  isInferred: False\n",
      "  hasDiagram: False\n",
      "  schemaClass: Compartment\n",
      "  identifier: \n",
      "  systematicName: \n",
      "  oldStId: \n",
      "  isInDisease: False\n",
      "  startCoordinate: nan\n",
      "  releaseDate: \n",
      "  stId: \n",
      "  isChimeric: False\n",
      "  abbreviation: \n",
      "  url: https://www.ebi.ac.uk/QuickGO/term/GO:0005576\n",
      "  labels: \n",
      "  volume: nan\n",
      "  diagramHeight: nan\n",
      "  taxId: \n",
      "  stIdVersion: \n",
      "  hasEHLD: False\n",
      "  pubMedIdentifier: nan\n",
      "  endCoordinate: nan\n",
      "  category: \n",
      "  diagramWidth: nan\n",
      "  id: n256\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_15908/3911405544.py:5: RuntimeWarning: Unknown attribute key 'label' in a <data> tag, ignoring attribute. at src/io/graphml.c:928\n",
      "  g = Graph.Read_GraphML(graphml_file_path)\n",
      "/tmp/ipykernel_15908/3911405544.py:5: RuntimeWarning: Unknown attribute key 'name' in a <data> tag, ignoring attribute. at src/io/graphml.c:928\n",
      "  g = Graph.Read_GraphML(graphml_file_path)\n"
     ]
    }
   ],
   "source": [
    "from igraph import Graph\n",
    "\n",
    "graphml_file_path = 'mouse_new.graphml'\n",
    "\n",
    "g = Graph.Read_GraphML(graphml_file_path)\n",
    "\n",
    "num_nodes_to_print = 5\n",
    "\n",
    "for idx in range(min(num_nodes_to_print, len(g.vs))):\n",
    "    node = g.vs[idx]  \n",
    "    print(f\"\\nNode {idx} attributes:\")\n",
    "    for attr in node.attributes():\n",
    "        print(f\"  {attr}: {node[attr]}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "20fe6b1d-50a5-4446-837d-e0a0342789c3",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
